Resolução Das Perguntas de Negócio

Instalando as Bibliotecas

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt
import plotly.express as px

In [2]:
# Supress Scientific Notation
np.set_printoptions(suppress=True)
pd.set_option('display.float_format', '{:.2f}'.format)

Buscando o DataFrame

In [3]:
# loading data into memory
data = pd.read_csv( 'datasets/kc_house_data.csv' )
# Garantir que o formato date seja um datetime
data['date'] = pd.to_datetime( data['date'], format='%Y-%m-%d' )

# 1 - Criando uma nova coluna chamada: “house_age”
- Se o valor da coluna “date” for maior que 2014-01-01 => ‘new_house’
- Se o valor da coluna “date” for menor que 2014-01-01 => ‘old_house’

In [4]:
# 1. Criar uma coluna nova, preenchida com NA
# 2. Substituir o valor NA, conforma a condicional
data['house_age'] = 'NA'
data.loc[data['date'] > '2014-01-01', 'house_age'] = 'new_house'
data.loc[data['date'] < '2014-01-01', 'house_age'] = 'old_house'
data.head(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,house_age
0,7129300520,2014-10-13,221900.00,3,1.00,1180,5650,1.00,0,0,...,1180,0,1955,0,98178,47.51,-122.26,1340,5650,new_house
1,6414100192,2014-12-09,538000.00,3,2.25,2570,7242,2.00,0,0,...,2170,400,1951,1991,98125,47.72,-122.32,1690,7639,new_house
2,5631500400,2015-02-25,180000.00,2,1.00,770,10000,1.00,0,0,...,770,0,1933,0,98028,47.74,-122.23,2720,8062,new_house

# 2 - Criando uma nova coluna chamada: “dormitory_type”
- Se o valor da coluna “bedrooms” for igual à 1 => ‘studio’
- Se o valor da coluna “bedrooms” for igual a 2 => ‘apartament’
- Se o valor da coluna “bedrooms” for maior que 2 => ‘house’

In [5]:
# 1. Criar uma coluna nova, preenchida com NA
# 2. Percorrer todas as linhas do conjunto de dados. Para cada linha, comparar a coluna "bedrooms"
# 3. De acordo com a comparação, substituir o NA pelo dado valor

data['dormitory_type'] = 'NA'
for i in range(len(data)):
    if data.loc[i, 'bedrooms'] == 1:
        data.loc[i, 'dormitory_type'] = 'studio'
    elif data.loc[i, 'bedrooms'] == 2:
        data.loc[i, 'dormitory_type'] = 'apartment'
    elif data.loc[i, 'bedrooms'] > 2:
        data.loc[i, 'dormitory_type'] = 'house'
data.head(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,house_age,dormitory_type
0,7129300520,2014-10-13,221900.00,3,1.00,1180,5650,1.00,0,0,...,0,1955,0,98178,47.51,-122.26,1340,5650,new_house,house
1,6414100192,2014-12-09,538000.00,3,2.25,2570,7242,2.00,0,0,...,400,1951,1991,98125,47.72,-122.32,1690,7639,new_house,house
2,5631500400,2015-02-25,180000.00,2,1.00,770,10000,1.00,0,0,...,0,1933,0,98028,47.74,-122.23,2720,8062,new_house,apartment

# 3 - Criando uma nova coluna chamada: “condition_type”
- Se o valor da coluna “condition” for menor ou igual à 2 => ‘bad’
- Se o valor da coluna “condition” for igual à 3 ou 4 => ‘regular’
- Se o valor da coluna “condition” for igual à 5 => ‘good’

In [6]:
# 1. Usar a função apply junto com a lambda para ter acesso a cada linha.
# 2. Em cada linha, comparar a coluna "condition" com a condição dada.
# 3. Aplicar a condição

data['condition'] = data['condition'].astype(int)
data['conditional_type'] = data['condition'].apply(lambda x: 'bad' if x <= 2 else 'regular' if (x == 3) | (x == 4) else 'good')
data.head(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,house_age,dormitory_type,conditional_type
0,7129300520,2014-10-13,221900.00,3,1.00,1180,5650,1.00,0,0,...,1955,0,98178,47.51,-122.26,1340,5650,new_house,house,regular
1,6414100192,2014-12-09,538000.00,3,2.25,2570,7242,2.00,0,0,...,1951,1991,98125,47.72,-122.32,1690,7639,new_house,house,regular
2,5631500400,2015-02-25,180000.00,2,1.00,770,10000,1.00,0,0,...,1933,0,98028,47.74,-122.23,2720,8062,new_house,apartment,regular

# 4 - Modifique o TIPO a Coluna “condition” para STRING

In [8]:
#Plotando o tipo de variavél
data[['id', 'condition']].dtypes

id            int64
condition    object
dtype: object

In [9]:
#Alterando o tipo da variavél
data['condition'] = data['condition'].astype(str)
# Plotando o novo tipo da variavél
data[['id', 'condition']].dtypes

id            int64
condition    object
dtype: object

 # 5 - Delete as colunas: “sqft_living15” e “sqft_lot15”

In [10]:
# deletar as colunas
data = data.drop(['sqft_living15', 'sqft_lot15'], axis=1)

# 6 - Modifique o TIPO a Coluna “yr_build” para DATE

In [21]:
data['yr_built'] = pd.to_datetime(data['yr_built'], format='%Y').dt.year
# usando a função ".dt.year" para buscar apenas o ano de construção.
data.head(10).dtypes

id                           int64
date                datetime64[ns]
price                      float64
bedrooms                     int64
bathrooms                  float64
sqft_living                  int64
sqft_lot                     int64
floors                     float64
waterfront                   int64
view                         int64
condition                   object
grade                        int64
sqft_above                   int64
sqft_basement                int64
yr_built                     int64
yr_renovated        datetime64[ns]
zipcode                      int64
lat                        float64
long                       float64
house_age                   object
dormitory_type              object
conditional_type            object
dtype: object

# 7 - Modifique o TIPO a Coluna “yr_renovated” para DATE

In [12]:
data[['yr_built','yr_renovated']].dtypes

yr_built        int64
yr_renovated    int64
dtype: object

In [11]:
data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,house_age,dormitory_type,conditional_type
0,7129300520,2014-10-13,221900.00,3,1.00,1180,5650,1.00,0,0,...,1180,0,1955,0,98178,47.51,-122.26,new_house,house,regular
1,6414100192,2014-12-09,538000.00,3,2.25,2570,7242,2.00,0,0,...,2170,400,1951,1991,98125,47.72,-122.32,new_house,house,regular
2,5631500400,2015-02-25,180000.00,2,1.00,770,10000,1.00,0,0,...,770,0,1933,0,98028,47.74,-122.23,new_house,apartment,regular
3,2487200875,2014-12-09,604000.00,4,3.00,1960,5000,1.00,0,0,...,1050,910,1965,0,98136,47.52,-122.39,new_house,house,good
4,1954400510,2015-02-18,510000.00,3,2.00,1680,8080,1.00,0,0,...,1680,0,1987,0,98074,47.62,-122.05,new_house,house,regular

# 8 - Qual a data mais antiga de construção de um imóvel?

In [27]:
# Modifique o TIPO a Coluna “yr_renovated” para DATE
data['yr_built'] = pd.to_datetime(data['yr_built'], format='%Y').dt.year
min_date_build = data['yr_built'].min()
print( f'The oldest house is {min_date_build} years old' )

The oldest house is 1900 years old

# 9 - Qual a data mais antiga de renovação de um imóvel?

In [28]:
data.drop(data[data.yr_renovated==0].index)
data['yr_renovated'] = pd.to_datetime(data['yr_renovated'])
min_date = data['yr_renovated'].min().year
print(f'The oldest house is {min_date} years old')

The oldest house is 1970 years old

# 10 - Quantos imóveis tem 2 andares?

 Estrategia:
* Filtrar todoso os imóveis com 2 andares
* Contar o número de linhas

In [32]:
# Filtrando (two_floors = data[data['floors'] == 2]) e contando o numero de linhas (.shape[0]).
two_floors = data[data['floors'] == 2].shape[0]
print(f'The number of houses with 2 floors is: {two_floors}')

The number of houses with 2 floors is: 8241

# 11 -  Quantos imóveis estão com a condição igual a “regular” ?

Estrategia
* Filtrar todos os apartamentos com "conditional_type" igual a "regular"
* Contar o número de imóveis sob essa condição

In [36]:
regular_house = data[data['conditional_type'] == 'regular'].shape[0]
print(f'Number of Houses in "regular" condition is: {regular_house}')

Number of Houses in "regular" condition is: 19710

# 12 - Quantos imóveis estão com a condição igual a “bad”e possuem “vista para água” ?
Estrategia
* Filtrar as colunas "conditional_type" igual a "bad" e "waterfront" igual a 1, usando a função "&"
* Contar o número de linhas

In [38]:
houses_bad_watter = data[(data['conditional_type'] == 'bad') & (data['waterfront'] == 1)].shape[0]
print(f'Number of Houses with water view and bad condition: {houses_bad_watter} houses')

Number of Houses with water view and bad condition: 2 houses

# 13 - Quantos imóveis estão com a condição igual a “good” e são “new_house”?

Estrategia
* Filtrar as colunas "conditional_type" igual a "good" e "house_age" equals to "new_house"
* Contar o número de linhas

In [42]:
good_house = data[(data['conditional_type'] == 'good') & (data['house_age'] == 'new_house')].shape[0]
print(f'Number of new house with good conditional type is: {good_house} houses.')

Number of new house with good conditional type is: 1701 houses.

# 14 - Qual o valor do imóvel mais caro do tipo “studio” ?
 
 Estrategia:
* Filtrar as colunas "dormitory_type" igual a "studio"
* Encontrar o máximo valor da coluna "price"

In [46]:
max_studio_price = data[data['dormitory_type'] == 'studio']['price'].max()
print(f'Most expensive studio house: ${max_studio_price}')

Most expensive studio house: $1247000.0

# 15 - Quantos imóveis do tipo “apartment” foram reformados em 2015 ?

Estrategia:
* Filtrar as colunas "dormitory_type" igual a "apartament" e "yr_renovated" equals to "2015-01-01"
* Contar o número de linhas

In [50]:
apart_renov = data[(data['dormitory_type'] == 'apartament') & (data['yr_renovated'] == 2015)].shape[0]
print(f'Number of reformed house in 2015: {apart_renov}')

Number of reformed house in 2015: 0

# 16 - Qual o maior número de quartos que um imóveis do tipo “house”] possui ?
Estrategia:
* Filtrar as colunas "dormitory type" igual a "house"
* Encontrar o maior valor da coluna bedrooms

In [53]:
house_bed = data[data['dormitory_type'] == 'house']['bedrooms'].max()
print(f'Max number of bedrooms from a house: {house_bed}')

Max number of bedrooms from a house: 33

#  17 - Quantos imóveis “new_house” foram reformados no ano de 2014?

 Estrategia:
* Filtrar as colunas "house_age" igual a "new-house" e "yr_renovated" equals to "2015-01-01"
* Contar o número de linhas

In [63]:
houses = data[(data['house_age'] == 'new_house') &
            (data['yr_renovated'] == 2014 )].shape[0]
print( "Number of reformed house in 2014: {}".format( houses ) )

Number of reformed house in 2014: 0

#  18. Selecione as colunas: “id”, “date”, “price”, “floors”, “zipcode” pelo método:
* Direto pelo nome das colunas
* Pelos índices
* Pelos índices das linhas e o nome das colunas
* Índices Booleanos

In [65]:
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'house_age', 'dormitory_type', 'conditional_type'],
      dtype='object')

In [66]:
### 1. Nome das colunas
df1 = data[['id', 'date', 'price', 'floors', 'zipcode']]
### 2. Índices
df2 = data.iloc[:, [0, 1, 2, 7, 16]]
### 3. Índices das linhas e nome das colunas
df3 = data.loc[:, ['id', 'date', 'price', 'floors', 'zipcode']]

# 19 - Salve um arquivo .csv com somente as colunas do item 10 ao 17.

In [67]:
data[['house_age', 'dormitory_type', 'conditional_type']].to_csv( 'exercicio18.csv' )